package by.mikhailov.algorithmization.sortarray.task05;

/**
 * Сортировка вставками.
 * Дана последовательность чисел а1,а2, ... , an . Требуется переставить числа в порядке возрастания.
 * Делается это следующим образом.
 * Пусть а1,а2, ... , ai - упорядоченная последовательность. т. е.
 * а1 <= а2 <= ... <=an  Берется следующее число аi+1 и вставляется в последовательность так, чтобы новая
 * последовательность была тоже возрастающей. Процесс производится до тех пор,
 * пока все элементы от (і +1 до n) не будут перебраны.
 *
 * Примечание.
 * Место помещения очередного элемента в отсортированную часть производить
 * с помощью двоичного поиска. Двоичный поиск оформить в виде отдельной функции.
 */

public class SortArray05 {
    public static void main(String[] args) {
        
    }
}
